---
kind: property
id: P:Autodesk.Revit.DB.Arc.XDirection
zh: 弧、圆弧
source: html/119af3f9-0efd-4ffa-c8aa-c795181af88d.htm
---
# Autodesk.Revit.DB.Arc.XDirection Property

**中文**: 弧、圆弧

Returns the X direction.

## Syntax (C#)
```csharp
public XYZ XDirection { get; }
```